var questions = [
    {
        "question":"你有修過基哥的課嗎?",//1
        "answers":[
            ["是的",2],
            ["沒有",3]
        ]
    },
    {
        "question":"你修過潘仁豪的課嗎?", //2修過基哥
        "answers":[
            ["是的",4],
            ["沒有",5]
        ]
    },
    {
        "question":"你通過CPE門檻了嗎?", //3沒修過基哥
        "answers":[
            ["是的",5],
            ["沒有",6]
        ]
    },
    {
        "question":"你每學期All Pass嗎?", //4PASS 潘+基
        "answers":[
            ["是的","A"],
            ["沒有",7]
        ]
    },
    {
        "question":"C++十分熟練了嗎?", //5修過潘 or 過CPE
        "answers":[
            ["是的",8],
            ["沒有",6]
        ]
    },
    {
        "question":"你會寫程式嗎?", //6修過潘 or 過CPE c++還不熟
        "answers":[
            ["當然",9],
            ["不太會","D"]
        ]
    },
    {
        "question":"你在兩位老師的課程中有被當過嗎", //7修過 潘+基
        "answers":[
            ["有",8],
            ["沒有","A"]
        ]
    },
    {
        "question":"你有做出可以向人介紹自己的作品嗎", // 8修過潘 or 過CPE or 修過潘+基 但被當
        "answers":[
            ["有","B"],
            ["沒有",10]
        ]
    },
    {
        "question":"有學過其他語言且比c++熟練嗎?",//9 修過潘 or 過CPE c++還不熟
        "answers":[
            ["有",8],
            ["沒有","C"]
        ]
    },
    {
        "question":"每個學期都有科目被當嗎?",//10
        "answers":[
            ["對","D"],
            ["並沒有","C"]
        ]
    }
    
];

var finalAnswers={
        "A":["<鑽石級學霸>","通過基哥的考驗、又經歷潘老師鑽石級課程的你。想必早已獨當一面，校外比賽也能取得好成績吧!"],
        "B":["<認真且扎實>","擁有自豪的作品之後，就是持續磨練自己，畢業時能擁有個作品集，可以嘗試參與比賽!"],
        "C":["<平穩中略有起伏>","有許多可以嘗試與進步的空間，每門課都多投入更多一點時間，挑戰每學期ALL Pass與CPE 3題以上吧"],
        "D":["<改變的時間點到了>","若是發覺自己對資工系沒有興趣、不適應，要盡早做出選擇，那如果不想轉走，就得抱著可能延畢的覺悟，拿出比別人加倍的努力!"]
};